/*Тема: Пространства имен
Задание 
В рамках предыдущих самостоятельных и домашних заданий вы создали набор классов по работе с различными 
примитивными математическими операциями (дробь, 
точка в двумерном пространстве, точка в трехмерном 
пространстве и т.д.). Разместите уже созданные классы 
в пространствах имен. Продумайте правильную структуру 
созданных пространств. Используя механизм пространств 
напишите код по тестированию полученного решения*/
#include"Header.h"
using namespace MyMath;

int main()
{
    Komplex k;
    Matrix<int> xxx(3, 3);
}