/*Мультиклассное задание 3
Создать класс MyPhone, описывающий устройство по следующим параметрам: id, цвет, вес, размеры (в мм.). 
В классе организуйте методы set и get для каждого поля При необходимости функцию redact можно реализовать через использование нескольких сеттеров и геттеров 
Реализуйте логику партийного создания устройств с заданием цвета партии (не в классе) 
Доп: id в партии задать случайным числом от -5 до +50. Телефоны с повторяющимися id или с отрицательными id переложить в отбракованные. 
Вывести партию без брака и отбракованные*/

#include <iostream>
#include <vector>
#include <string>

using namespace std;

class MyPhone
{
    int id, weight;
    double diag;
    string name, color;


};

int main()
{
    std::cout << "Hello World!\n";
}

